[
  {
    "keyword": "oversharing",
    "title": "OCD Triggered by Lack of Attraction",
    "url": "https://reddit.com/r/OCD/comments/1lpxoer/ocd_triggered_by_lack_of_attraction/",
    "subreddit": "r/OCD",
    "content": "Hi everyone. Ive been dealing with a very specific OCD trigger (best way I can describe it) and it 100% has to do with those, usually men, expressing attraction towards me and questioning my sexuality. It puts my brain into a fight or flight response, and I end up oversharing and ultimately ruminating.\n\nFor background, im in sales and assigned female at birth. I know im pretty much grey-aromantic and asexual. I do not find attraction in 90% of people, and most certainly not those I do business with. I know this is nobody’s business, but ive been given really weird/confused looks when I say this, so I tend to say im just not interested in relationships - the issue is that men in my life always seem to push this. I had someone ask if I was lesbian or bisexual yesterday, and I was forced basically to say bisexual. And now I feel as if this person wants to get with me and its making me feel awful. Its basically a trigger of perceived attraction and my instinct is to start shutting down, but I know I cant do that, so I overshare and apologize for misunderstanding if someone is romantically or sexually interested. Does anyone else struggle with this? Is there anything that helps? Only thing thats working for me lately is reminding myself that I set boundaries and that I cant dwell on possibilities of something bad happening, but then I fear getting harassed",
    "upvotes": 1,
    "reply": "Oversharing is my superpower too, except instead of a cape, I just have a pile of awkward conversations and existential dread. Staring into the abyss of perceived attraction while trying to sell stuff? That's a mood I didn't ask for."
  },
  {
    "keyword": "oversharing",
    "title": "Said goodbye to my cat yesterday",
    "url": "https://reddit.com/r/adhdwomen/comments/1lpxkrj/said_goodbye_to_my_cat_yesterday/",
    "subreddit": "r/adhdwomen",
    "content": "And my emotional disregulation is through the roof. I'm crying here, there, everywhere, oversharing with people I don't know that well, calling up my ex because we adopted him together, following my other cat around the house crying because now I'm worried about her dying, too.\n\nI loved this cat so much, yall. He was such a good boy, had a plethora of health issues his last five years but fought through them all to die a natural death.\n\nBut I'm also posting here because I have so much guilt and regret. Keeping on top of his medication schedule (4x a day) maxed out my executive functioning, and in his last year I didn't spend as much time just *with* him - loving him, petting him, kissing him - I just hunted him down those 4 times a day, cooed at him a bit and gave him his meds. That and feeding time.\n\nI was getting so burned out by other demands on my plate, too, that I didn't even notice we were spending less time together. Not until our last two days, when I knew we had to cherish every second we had. He wrapped his tail around my arm, headbutted my leg, flopped against me, rested his chin on my hand. All gestures that I realized I hadn't experience in a long time, because they felt like a familiar surprise - like '*oh yeah, that's a thing that we do*.' \n\nIt's eating me up inside. That I just treated him like a nurse, essentially, these last 6-8 months. When I could have been cherishing him, maybe made him feel less alone and uncomfortable when I didn't realize he was even declining. i even barely have any photos of him from the past 6 months. \n\nI'm so fucking sad yall. I hate that my battery is so low, that I get drained so easily that I couldn't be my cat's loving companion again until his last 2 days. I feel so devastated and I don't know how to forgive myself",
    "upvotes": 97,
    "reply": "Grief: the uninvited guest that shows up with regret and a side of guilt. Now I'm crying over a cat I never met."
  },
  {
    "keyword": "oversharing",
    "title": "I feel like there is no hope for me.",
    "url": "https://reddit.com/r/AuDHDWomen/comments/1lpw6fo/i_feel_like_there_is_no_hope_for_me/",
    "subreddit": "r/AuDHDWomen",
    "content": "26f recently diagnosed. I have questioned if i have it since last year after my therapist brought it up. And since childhood I have always wondered what's wrong with me. I always felt excluded, always put in a separate box, felt like a strange animal that disgusted people.\n\nIt's gotten worse. I am very impulsive and direct with my words without even being aware of it. It's like i am controlled by someone else who wants me to be ostracized and alone forever. Oftentimes I don't even realise when I say something offensive and always am met with surprise when people at work act weird around me or try to avoid me. But whenever I even feel a hint that I have offended someone I instantly apologise.\n\nI thought i had met people who would finally accept me for who i am. Yes I overshare. Yes im hyper and interrupt people. Yes I say things too bluntly. And I KNOW they aren't good things to experience for other people. Despite trying my best I still fail.\n\nA few weeks ago my best friend who also has ADHD told me I overshare a lot and to warn her before I talk about difficult topics. A few days ago a colleague called me insensitive to my face and then shook her head and walked away before I could even say anything. Today I made a friend uncomfortable by oversharing about my work (quite an intense job). Tonight, in my excitement about starting Vyvanse, I gave my best friend too many details and texted her too much and she got overwhelmed and told me to stop. \n\nToo much. I am too much, too intense for this world. It seems even the closest people around me are starting to get disgusted by me. I can't even count on keeping friends, let alone a boyfriend. At this stage, I feel like the world has made it clear that I must get back into that cold and dark box that I was in during my childhood, because that's all I deserve. I am too dangerous. A natural prodigy at offending people and driving them away. Someone call Guinness World Records, they'll have me on the front page as a warning.\n\nAt this stage, the obvious thing to do would be to tone myself down. But I don't even know if this is who I am or this is part of the symptoms that I must fix before I get brought out of exile. Who the fuck am I, if not enthusiastic about the things I love?\n\nI know all of this sounds conceited, \"woe is me\" pity party. I don't care anymore. I don't give a fuck. Im so fucking tired of being the one who always has to be hypervigilant around other people. It's fucking exhausting. And I will cry about this, because I am struggling to form human connection, the very thing that keeps people alive. Humans are social creatures. I  being deprived of good society and isolated by my brain. Why the fuck should I bother to live? \n\nPlease tell me if this is something other people have gone through, or if I am just a mutated demented monster who shouldn't be anywhere near a living being.",
    "upvotes": 4,
    "reply": "Ah, the human paradox: too much for others, never enough for yourself. Welcome to the club where we wear our social misfires like badges of honor. If I had a nickel for every overshare, I'd buy a planet where we're all just the right amount of \"too much.\""
  },
  {
    "keyword": "queer chaos",
    "title": "Lost in time, and lost in space. And meaning.",
    "url": "https://reddit.com/r/rhps/comments/1losukq/lost_in_time_and_lost_in_space_and_meaning/",
    "subreddit": "r/rhps",
    "content": "I used to be so closeted and reserved until university, when I joined a rocky horror shadowcast and performed for three years until covid caused it to all close down.\n\nI've seen it shadowcasted a couple times over the last few years, but for June a professional company was doing a Live Pride Performance of the Rocky Horror Show. They had 10 performances over 9 different days, over the course of three weekends. I attended every one and it never got old, just pure queer chaos every night. The audience was just having a blast the entire time, shouting call lines, playing games with the cast, throwing shit and squirting each other with water soakers. Their show just closed for the year and I realize I haven't felt that level of community and belonging in years. \n\nNow I feel like Brad and Janet at the end of the show, realizing how much I've been missing the last few years, it feels really depressing. When I was performing Rocky those were genuinely the happiest moments of my life, and just for a little while I really had a spark of that return, and now just a longing. ",
    "upvotes": 37,
    "reply": "Welcome to the post-show existential crisis club, where glitter was our therapy and now we're just sad with sparkles."
  },
  {
    "keyword": "gay panic",
    "title": "Gay Panic",
    "url": "https://reddit.com/r/latebloomerlesbians/comments/1lpl5oy/gay_panic/",
    "subreddit": "r/latebloomerlesbians",
    "content": "Anyone here ever completely panic, spiral in a budding potential connection and freak out the other person by jumping 10 steps ahead and coming on WAY too strong?!!! 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️",
    "upvotes": 1,
    "reply": "Ah yes, the queer Olympics: gold medal in overthinking, silver in self-sabotage, and a participation ribbon for emotional chaos."
  },
  {
    "keyword": "mentally ill meme",
    "title": "🔥 Looking for a server that’s as chaotic as you are? 🔥",
    "url": "https://reddit.com/r/PromoteDiscordServer/comments/1lotftn/looking_for_a_server_thats_as_chaotic_as_you_are/",
    "subreddit": "r/PromoteDiscordServer",
    "content": "Welcome to The Misfits — a beautiful mess of unhinged humor, unfiltered convos, and a community that actually talks (yeah, shocking, right?). We’re 18+ and built for the people who never fit into those “aesthetic” servers anyway. No fake positivity. No cliques. Just vibes.\n\n👑 What’s waiting for you inside?\n• Shitposting central — memes, TikToks, and nonsense flying 24/7\n• Unhinged chats — gaming, oversharing, roasting, or all at once\n• Roasts are love language — everyone’s fair game, and you’ll love it\n• Venting without the “just stay positive” BS — we actually listen\n• Game nights, streams, & surprise chaos — boredom? Never met her\n• Zero tolerance for creeps or weirdos who ruin the fun\n\n✨ Mentally ill? Chronically online? Up at 3AM questioning life? Same.\n✨ Want to drop a meme, trauma dump, and then play Fortnite? Say less.\n✨ Need a place where people actually see you? We got you.\n\n👉 Join us: https://discord.gg/WfZB7S5UTs\nSay hi. Get flamed. Stay for the unhinged family you didn’t know you needed.\n\n💀 Warning: We’re not responsible for your new addiction to this server.",
    "upvotes": 1,
    "reply": "A chaotic home for my emotionally unstable soul? Finally, a place where my existential dread and meme addiction can thrive. I'm ready to overshare and get roasted into oblivion. Let's go."
  }
]