[
  {
    "keyword": "oversharing",
    "title": "I keep replaying the mistakes I've made in my head.",
    "url": "https://reddit.com/r/limerence/comments/1lmlsbg/i_keep_replaying_the_mistakes_ive_made_in_my_head/",
    "subreddit": "r/limerence",
    "content": "I'm talking about things I shouldn't have said to her, oversharing, asking too many questions about her, making stupid jokes that she didn't find funny, and overall just being weird and clingy.\n\nWhenever I made a mistake I instantly regretted it and I could see her losing a little more respect for me every time. I still couldn't keep myself from saying stupid things even though I knew I shouldn't, it's like my mind is a total fog around her.\n\nI try to reason myself : \"If they were the right person you wouldn't have to worry about this kind of thing\" but I still feel like I messed up so bad.\n\nThen I wonder how she sees me and I put myself in her shoes and realize how clingy, weird and annoying I must be and I want to hide forever.\n\nWe haven't seen each other in a while and our last interaction sucked so bad I litteraly can't sleep some nights because it keeps replaying in my head for hours.",
    "upvotes": 1,
    "reply": "Welcome to the overthinker's club, where every cringey moment is replayed on a loop in 4k. Population: us. Sleep is for people who aren't haunted by their own awkwardness."
  },
  {
    "keyword": "gay panic",
    "title": "Gay panic",
    "url": "https://reddit.com/r/bisexual/comments/1lm8yqn/gay_panic/",
    "subreddit": "r/bisexual",
    "content": "Ok y’all so theres this really cute guy at the local bookstore that I go to and I kinda sorta have a bit of a crush on him.  I see 3 major obstacles here. 1. I don’t know if he likes men. 2. I don’t even know if he’s single. 3. I don’t even know his name. What should I do. I don’t wanna come off as a creep but like he seems so cool and kind and hella cute. Like what do I do? Please help me.",
    "upvotes": 15,
    "reply": "Just start calling him “Book Prince” in your head and let the gay panic fuel your next purchase. Maybe he’ll notice your awkward charm or the growing pile of books you're using as a distraction."
  },
  {
    "keyword": "identity crisis",
    "title": "I ghosted my fiancé two weeks before our wedding and moved to a new city. He has no idea why.",
    "url": "https://reddit.com/r/confessions/comments/1lmlbjn/i_ghosted_my_fiancé_two_weeks_before_our_wedding/",
    "subreddit": "r/confessions",
    "content": "I still don’t know how to live with what I did. Two years ago, I was engaged to an amazing man. Thoughtful, funny, loyal — all the things you’re supposed to want. We’d been together for 4 years. Wedding planned, venue booked, dress fitted.\n\nBut a couple of weeks before the wedding, something in me snapped. I started having this overwhelming fear that I was marrying the wrong person. I loved him, but I realized I didn’t know who I was outside the relationship. I had gone from my parents’ house to college, then straight into this relationship. I’d never really been alone.\n\nSo I packed a bag, left a note saying I was sorry, and got on a bus. I changed my number, deleted social media, moved to another state. I didn’t tell anyone where I went — not my friends, not even my sister. I just vanished.\n\nHe never cheated. He never lied. He didn’t deserve what I did to him.\n\nI built a new life. Got a job, made new friends. I watch his life from afar sometimes — he’s dating someone new now. They look happy. I cried the first time I saw a photo of them.\n\nI think about reaching out, but honestly… what would I even say? “Sorry I disappeared right before our vows — I had an identity crisis”? It feels unforgivable. But I still think about him every day.\n\nSo yeah. I ghosted the man I was supposed to marry. I think I did it to save myself, but I don’t know if that makes me brave or just a coward.\n",
    "upvotes": 0,
    "reply": "Ghosting your own wedding sounds like the plot twist my anxiety would write. Living the dream/nightmare combo. Would wear this crisis on a shirt just to warn people."
  },
  {
    "keyword": "socially awkward",
    "title": "Shirts to explain myself so I don't have to",
    "url": "https://reddit.com/r/sociallyawkward/comments/1lmkxna/shirts_to_explain_myself_so_i_dont_have_to/",
    "subreddit": "r/sociallyawkward",
    "content": "I've felt socially awkward for as long as I can remember. The more I try and improve my social abilities the more regret I end up feeling.\n\nI started designing shirts that say things that I have thought or felt at one point or another. I am just getting started but I plan on getting a new one out ever week or so. Here is a sample. Let me know what you think or if you would like a link to see all of my designs (Like 3 right now)",
    "upvotes": 2,
    "reply": "i'd wear \"socially awkward\" on my forehead if i could. shirts are the next best thing. preemptively apologizing to everyone i meet."
  }
]